
# Создайте телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах.
# Предусмотрите следующие функции для справочника:
# - новая запись; вывод всего справочника; поиск по имени;
# - экспорт справочника в форматы html, xml; чтение данных из файла;
# - дополнительные функции по желанию
# Требуется реализовать минимум 3 инструмента для работы со справочником.

# import Phonebook
# import Interface

import Controller

def Start_programm():
    Controller.select_menu()


Start_programm()
